www/doc/remoteswank.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Удаленное использование swank</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Удаленное использование swank</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7c7d632">Интро</a></li>
<li><a href="#org29f237a">Шаг за шагом</a>
<ul>
<li><a href="#org2c3cc58">SSH-коннект и запуск lisp</a></li>
<li><a href="#orge8581d6">Запуск swank-server</a></li>
<li><a href="#org2db72bc">SSH-туннелирование</a></li>
</ul>
</li>
<li><a href="#org1e4685e">Полезные вещи</a>
<ul>
<li><a href="#org0fe0dcc">Тайм-аут SSH</a></li>
<li><a href="#org3a8c5e7">Конфигурация emacs</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7c7d632" class="outline-2">
<h2 id="org7c7d632">Интро</h2>
<div class="outline-text-2" id="text-org7c7d632">
<p>
Начнем с цитаты:
</p>

<blockquote><i>
<p>
И даже более впечатляющий пример удаленной отладки произошел в миссии NASA «Deep Space 1» в
1998 году. Через полгода после запуска космического корабля, небольшой код на Lisp должен был
управлять космическим кораблем в течении двух дней для проведения серии экспериментов. Однако,
неуловимое состояние гонки (race condition) в коде не было выявлено при тестировании на земле и
было обнаружено уже в космосе. Когда ошибка была выявлена в космосе (100 миллионов миль от
Земли) команда смогла произвести диагностику и исправление работающего кода, что позволило
завершить эксперимент. Один из программистов сказал об этом следующее:
</p>

<p>
— Отладка программы, работающей на оборудовании стоимостью 100 миллионов долларов, которая
находится в 100 миллионах миль от вас, является интересным опытом. REPL, работающий на
космическом корабле, предоставляет бесценные возможности в нахождении и устранении проблем.
</p>
</i></blockquote>
</div>
</div>

<div id="outline-container-org29f237a" class="outline-2">
<h2 id="org29f237a">Шаг за шагом</h2>
<div class="outline-text-2" id="text-org29f237a">
</div>
<div id="outline-container-org2c3cc58" class="outline-3">
<h3 id="org2c3cc58">SSH-коннект и запуск lisp</h3>
<div class="outline-text-3" id="text-org2c3cc58">
<p>
Я использую <code>screen</code> для того чтобы отвязать процесс от терминальной сессии
</p>

<div class="org-src-container">
<pre class="src src-sh">ssh user@host.ru
screen
sbcl
</pre>
</div>
</div>
</div>

<div id="outline-container-orge8581d6" class="outline-3">
<h3 id="orge8581d6">Запуск swank-server</h3>
<div class="outline-text-3" id="text-orge8581d6">
<p>
Вместо asdf можно использовать quicklisp. Версия swank должна быть той
же как на удаленной машине, так и на локальной.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(require 'asdf)
(asdf:oos 'asdf:load-op 'swank)
(setq swank:*use-dedicated-output-stream* nil)
(swank:create-server :coding-system "utf-8-unix" :dont-close t :port 4005)
</pre>
</div>

<p>
Этот код запустит swank внутри sbcl и он (swank) начнет слушать 4005
порт. Но, разумеется, он будет делать это на на удаленной
машине. Теперь мы можем выйти, оставив сессию <code>screen</code> запущенной, для
этого нажимаем <code>Ctrl+a d</code>.
</p>
</div>
</div>

<div id="outline-container-org2db72bc" class="outline-3">
<h3 id="org2db72bc">SSH-туннелирование</h3>
<div class="outline-text-3" id="text-org2db72bc">
<p>
Открываем ssh-туннель со своей машины на удаленную:
</p>

<div class="org-src-container">
<pre class="src src-sh">ssh -2 -N -f -L 4005:localhost:4005 user@host.ru
</pre>
</div>

<p>
Теперь все обращения к нашему 4005 порту будут уходить на удаленную
машину и обращаться там по 4005 порту - а нам это и надо.
</p>
</div>
</div>
</div>

<div id="outline-container-org1e4685e" class="outline-2">
<h2 id="org1e4685e">Полезные вещи</h2>
<div class="outline-text-2" id="text-org1e4685e">
</div>
<div id="outline-container-org0fe0dcc" class="outline-3">
<h3 id="org0fe0dcc">Тайм-аут SSH</h3>
<div class="outline-text-3" id="text-org0fe0dcc">
<p>
Если туннель обрывается по тайм-ауту, можно попробовать прописать в <code>/etc/ssh/ssh_config</code>
директиву <code>ServerAliveInterval 5</code>
</p>
</div>
</div>

<div id="outline-container-org3a8c5e7" class="outline-3">
<h3 id="org3a8c5e7">Конфигурация emacs</h3>
<div class="outline-text-3" id="text-org3a8c5e7">
<div class="org-src-container">
<pre class="src src-elisp">;; Lisp (SLIME) interaction
(setq inferior-lisp-program "sbcl"
lisp-indent-function 'common-lisp-indent-function
slime-complete-symbol-function 'slime-fuzzy-complete-symbol
; common-lisp-hyperspec-root "file:///Users/lisp/HyperSpec"
slime-startup-animation nil)
;; SLIME
(add-to-list 'load-path "~/.emacs.d/slime")
(require 'slime)
;(set-language-environment "utf-8")
(setq slime-net-coding-system 'utf-8-unix)
(slime-setup '(slime-fancy))
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
